Repository: noklen/sdk-ios
Catalog: Frameworks/ReaderSDK2UI/Resources/*.lproj/Localizable.strings
Languages: ca_es, es, fr_fr, ja

# ReaderSDK2UI_GenericStrings_ErrorDismissButtonTitle
source: Dismiss
ca_es: Ignora
es: Ignorar
fr_fr: Fermer
ja: 閉じる

# ReaderSDK2UI_PayScreen_Prompt_Chip
source: Insert to Pay
ca_es: Insereix per pagar
es: Insertar para pagar
fr_fr: Insérer la carte pour payer
ja: 挿入して支払う

# ReaderSDK2UI_PayScreen_Prompt_Chip_Contactless
source: Insert or Tap to Pay
ca_es: Insereix o apropa per pagar
es: Insertar o acercar para pagar
fr_fr: Insérer ou approcher la carte pour payer
ja: 挿入/タッチしてお支払いを完了します

# ReaderSDK2UI_PayScreen_Prompt_NoReadersConnected
source: No Readers Connected
ca_es: Cap lector connectat
es: No hay lectores conectados
fr_fr: Aucun lecteur connecté
ja: リーダーに接続されていません

# ReaderSDK2UI_PayScreen_Prompt_Swipe
source: Swipe to Pay
ca_es: Fes lliscar per pagar
es: Deslizar para pagar
fr_fr: Glisser la carte pour payer
ja: スワイプして支払います

# ReaderSDK2UI_PayScreen_Prompt_Swipe_Chip
source: Swipe or Insert to Pay
ca_es: Fes lliscar o insereix per pagar
es: Deslizar o insertar para pagar
fr_fr: Glisser ou insérer la carte pour payer
ja: カードを挿入（スワイプ）して支払いを完了する

# ReaderSDK2UI_PayScreen_Prompt_Swipe_Chip_Contactless
source: Swipe, Insert or Tap to Pay
ca_es: Per pagar, fes lliscar, insereix o apropa
es: Deslizar, insertar o acercar para pagar
fr_fr: Glisser, insérer ou approcher la carte pour payer
ja: 挿入/スワイプしてお支払いを完了します

# ReaderSDK2UI_PayScreen_TotalAmountHeader
source: TOTAL
ja: 合計

# ReaderSDK2UI_PayScreen_alertTitle
source: Error Occurred
ca_es: S’ha produït un error
es: Ocurrió un error
fr_fr: Erreur survenue
ja: エラーが発生しました

# ReaderSDK2UI_PayScreen_noCardId
source: Attempting to create card on file payment without a value set for cardID.
ca_es: Estàs intentant crear un pagament amb una targeta desada sense abans haver configurat un valor com a identificador de la targeta.
es: Se está intentando crear un pago con tarjeta guardada sin un valor establecido para cardID.
fr_fr: Essai de création d’un paiement par carte enregistrée sans valeur définie pour cardID.
ja: cardIDに値が設定されていないまま、保存済みのカード情報での支払いを作成しようとしています。

# ReaderSDK2UI_PayScreen_okayButton
source: Okay
ca_es: D’acord
es: Aceptar
fr_fr: OK
ja: OK

# ReaderSDK2UI_ReaderDetail_BatteryRow
source: Battery
ca_es: Bateria
es: Batería
fr_fr: Batterie
ja: バッテリー

# ReaderSDK2UI_ReaderDetail_FirmwareFailedAlertTitle
source: Firmware Upgrade failure
ca_es: S’ha produït un error en l’actualització del microprogramari
es: Error en la actualización del firmware
fr_fr: Échec de mise à jour micrologicielle
ja: ファームウェアのアップデート失敗

# ReaderSDK2UI_ReaderDetail_FirmwareRow
source: Firmware
ca_es: Microprogramari
fr_fr: Micrologiciel
ja: ファームウェア

# ReaderSDK2UI_ReaderDetail_ForgetReaderButton
source: Forget
ca_es: Desvincula
es: Olvidar
fr_fr: Oublier
ja: 忘れる

# ReaderSDK2UI_ReaderDetail_GeneralSection
source: General
fr_fr: Général
ja: 一般

# ReaderSDK2UI_ReaderDetail_IdentifyReaderButton
source: Identify this Reader
ca_es: Identifica aquest lector
es: Identifique este Lector
fr_fr: Identifier ce lecteur
ja: このリーダーを特定する

# ReaderSDK2UI_ReaderDetail_ReaderStateRow
source: State
ca_es: Comunitat autònoma
es: Estado
fr_fr: État
ja: 州

# ReaderSDK2UI_ReaderDetail_ReconnectReaderButtonTitle
source: Retry connection
ca_es: Torna a provar la connexió
es: Reintentar la conexión
fr_fr: Reconnexion
ja: 接続の再試行

# ReaderSDK2UI_ReaderDetail_SerialNumberRow
source: Serial Number
ca_es: Número de sèrie
es: Número de serie
fr_fr: Numéro de série
ja: シリアル番号

# ReaderSDK2UI_ReaderDetail_SupportedInputMethodsRow
source: Accepts
ca_es: Accepta
es: Acepta
fr_fr: Accepte
ja: 受付可能なカード

# ReaderSDK2UI_ReaderPairing_BluetoothPairingInstructions
source: Press and hold the button on your reader until the lights flash orange. Then release the button and place the reader next to this device to pair.
ca_es: Prem i mantingues premut el botó del lector fins que els llums parpellegin en taronja, després deixa anar el botó i col·loca el lector a prop d’aquest dispositiu per emparellar-lo.
es: Mantén presionado el botón del lector hasta que la luz parpadee de naranja y suelta el botón. Coloca el lector al lado de este dispositivo para emparejarlo.
fr_fr: Appuyez sur le bouton de votre lecteur jusqu’à ce que le voyant clignote en orange, puis relâchez le bouton et placez le lecteur près de cet appareil pour l’associer.
ja: オレンジ色のランプが点滅するまでリーダーの電源ボタンを押し続け、ランプが点灯したらボタンを離し、リーダーを端末の隣に置いてペアリングします。

# ReaderSDK2UI_ReaderPairing_ErrorTitle
source: Failed to Pair
ca_es: No s’ha pogut emparellar
es: Error al emparejar
fr_fr: Échec de la connexion
ja: ペアリングに失敗しました

# ReaderSDK2UI_ReaderPairing_LookingForReaders
source: Looking for readers...
ca_es: Cercant lectors...
es: Buscando lectores...
fr_fr: Recherche de lecteurs…
ja: リーダーを探しています...

# ReaderSDK2UI_ReaderPairing_PairingWithReader
source: Pairing with readerâ€¦Yes
ca_es: Emparellant amb el lector…
es: Emparejando con el lector...
fr_fr: Association avec le lecteur...
ja: リーダーをペアリングしています...

# ReaderSDK2UI_ReaderPairing_Title
source: Pair Your Reader
ca_es: Emparella el lector
es: Emparejar lector
fr_fr: Associer votre lecteur
ja: リーダーをペアリングする

# ReaderSDK2UI_ReaderSwipeAction_Forget
source: Forget
ca_es: Desvincula
es: Olvidar
fr_fr: Oublier
ja: 忘れる

# ReaderSDK2UI_ReaderSwipeAction_Identify
source: Identify
ca_es: Identifica
es: Identificación
fr_fr: Identifier
ja: 識別

# ReaderSDK2UI_Readers_ConnectReaderButtonTitle
source: Connect a reader
ca_es: Connecta un lector
es: Conectar un lector
fr_fr: Connecter un lecteur
ja: リーダーを接続

# ReaderSDK2UI_Readers_HardwareSection
source: Hardware
ca_es: Components
fr_fr: Matériel
ja: 周辺機器

# ReaderSDK2UI_Readers_Title
source: Readers
ca_es: Lectors
es: Lectores
fr_fr: Lecteurs
ja: リーダー
